"""
TODO: написать тесты как минимум на следующие сценарии:

- Дерево можно создать с отрицательной высотой и нулевой (это будет считаться как 1)
- Дерево можно создать с нулевым и отрицательным корнем
(эти ситуации отразить в сабтестах для следующих тестов)

- Можно передать в конструктор функции, которые принимают и возвращают только одно целое значение
- Если на вход идёт неправильная функция, должно выкидываться исключение
- Дерево должно строиться рекурсивно
- Дерево должно строиться нерекурсивно
- Должен работать рекурсивный вывод в виде словаря (тестирую на простом примере!)
- Должен работать нерекурсивный вывод в виде словаря (аналогично)
- Должен быть вывод в виде списка (тут уже можно посложнее)
==
Тут 7 тестов (и 14 сабтестов)

- Нельзя пихнуть плохое (не int) значение в корень дерева
- Аналогично нельзя пихнуть (не int) плохое значение в высоту дерева
- То же самое с is_recursive (не y/n)
==
И здесь ещё 3

Итого 10
"""
