"""
TODO: написать тесты как минимум на следующие сценарии

Тесты дерева:
- Дерево можно создать с положительным целым корнем
- Дерево можно создать с положительным вещественным корнем
- Дерево можно создать с отрицательным целым корнем
- Дерево можно создать с отрицательным вещественным корнем
- Можно передать в конструктор функции, которые принимают и возвращают только одно целое значение
- Если на вход идёт неправильная функция, должно выкидываться исключение
- Дерево должно строиться рекурсивно
- Дерево должно строиться нерекурсивно
- Должен работать рекурсивный вывод в виде словаря (тестирую на простом примере!)
- Должен работать нерекурсивный вывод в виде словаря (аналогично)
- Должен быть вывод в виде списка (тут уже можно посложнее)

Тесты ввода:
- Нельзя пихнуть плохое (не числовое) значение в корень дерева
- Аналогично нельзя пихнуть (не int и не положительное) плохое значение в высоту дерева
- То же самое с is_recursive (не y/n)

Итого 14
"""
